src/Enums/ВидыДополнительныхВнешнихОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхВнешнихОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеТабличныхЧастей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
					<Comment>Внешний отчет</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Catalog>
		<Properties>
			<Name>ВнешниеОбработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеВнешнейОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхВнешнихОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКФайлуИсточнику</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Принадлежность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаОбъекта</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧастьИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧастьПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиПостроителяДляОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеВнешнейОбработки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменяемаяПечатнаяФорма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаПечатнойФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОтбораПостроителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКнопки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеПараметрыОбработки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеНастроекОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/мшОткрытьВнеш/Ext/Module.bsl
// Функция предназначенная для открытия внешней обработки, сохраненной в БД
 
//
 // Параметры
 
//  Обработка  - ссылка на элемент справочник ВнешниеОбработки
 //
 
// Возвращает объект внешнюю обработку/отчет, если не удалось открыть форму по умолчанию
Функция ОткрытьВнешнююОбработкуИзБД(ОбработкаСсылка, ВернутьСсылку = ЛОЖЬ)
    
    ЭтоОбработка = ?(ОбработкаСсылка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Обработка, Истина, Ложь);
    ЭтоОтчет = ?(ОбработкаСсылка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет, Истина, Ложь);
    
    ИмяФайла = ПолучитьИмяВременногоФайла();
    ДвоичныеДанные = ОбработкаСсылка.ХранилищеВнешнейОбработки.Получить();
    ДвоичныеДанные.Записать(ИмяФайла);
    
	Если ЭтоОтчет Тогда
		Если ВернутьСсылку Тогда
			Возврат ВнешниеОтчеты.Создать(ИмяФайла);
		Иначе
        	Форма = ВнешниеОтчеты.ПолучитьФорму(ИмяФайла);
		КонецЕсли;
    Иначе
        Форма = ВнешниеОбработки.ПолучитьФорму(ИмяФайла);
    КонецЕсли;
    
    Если Не Форма = Неопределено Тогда
        Форма.Открыть();
    Иначе
        ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла);
        
        Возврат ВнешняяОбработка;
    КонецЕсли;
    
КонецФункции


Процедура ОткрытьОтчетПоНеЗакрытымРаспискам() Экспорт
	//МИША!!! Изменить	
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000012"); 
    Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
    ОткрытьВнешнююОбработкуИзБД(Ссылка);

КонецПроцедуры

Процедура ОткрытьОтчетПоСтоимостиТовараНаСкладах() Экспорт
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000014");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
    ОткрытьВнешнююОбработкуИзБД(Ссылка);
КонецПроцедуры

Процедура ОткрытьОтчетПоПросроченнойДебиторскойЗадолженности() Экспорт
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000015");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
    ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Функция ПолучитьОтчетПоПросроченнойДебиторскойЗадолженности() Экспорт
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000015");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
    Возврат ОткрытьВнешнююОбработкуИзБД(Ссылка,Истина);	
КонецФункции
             
Процедура ОткрытьОтчетПоПросроченнымТоварам() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000018");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьОбработкуЗакрытияКонтрактов() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000019");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры                                  

Процедура ОткрытьЗапчастиСтоимостьВНакладных() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000020");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьГрафикОплатыОтгрузки() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000021");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьОтчетПоКонтрактамБезДвиженияДваМесяца() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000022");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьНеПроставленыСвойстваВНоменклатуре() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000023");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьОтчетПоКонтрагентамСНепроставленнымиСвойствамиПринадлежности() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000024");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьОтчетПоПродажамВектораСоСвойствами() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000026");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры

Процедура ОткрытьПоискДокументовПоНомеру() Экспорт 
	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("000000027");
	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
 
	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
КонецПроцедуры



// Шаблон!!!
//Процедура Открыть<Название отчета или обработки>() Экспорт 
//	ВнешОтчет = Справочники.ВнешниеОбработки.НайтиПоКоду("<КодВнешнегоОтчета>");
//	Ссылка = Справочники.ВнешниеОбработки.ПолучитьСсылку(ВнешОтчет.УникальныйИдентификатор());
// 
//	ОткрытьВнешнююОбработкуИзБД(Ссылка);	
//КонецПроцедуры
